<a href="https://colab.research.google.com/github/Luis-Eduardo-P-Ch/Programacion-para-el-Analisis-de-datos/blob/main/Practica4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Programación para Análisis de datos
## Práctica 4: Pandas
 


<b>Nota:</b>
Esta practica esta basada en los ejercicios de varios recursos online como:

* https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb
* https://www.machinelearningplus.com/python/101-pandas-exercises-python/
* https://www.kaggle.com/learn/pandas
* https://github.com/facuzeta/pandas_exercises
* https://github.com/guipsamora/pandas_exercises


<b>Indice:</b>

1. [Extracción de datos](#Extraer-datos:-Restaurant)
2. [Filtrar datos](#Filtrar-datos)
3. [GroupBy](#GroupBy)
4. [Apply](#Apply:-Student-Alcohol-Consumption)
5. [Merge](#Merge:-Housing-Market)
6. [Stats](#Stats:-US---Baby-Names)
7. [Deleting](#Deleting:-Iris)
8. [Bonus](#lab#Bonus:)

# Extraer datos: Restaurant
Referencias:
* [Read_csv](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)
* [Group by](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html)
* [dtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html)

1. Import the necessary libraries

In [ ]:
import pandas as pd

2. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/chipotle.tsv).

In [ ]:
df = pd.DataFrame()
df = pd.read_csv('https://facuzeta.github.io/udesa/01_programacion/guias/datasets/chipotle.tsv', sep='\t')
df

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

3. Assign it to a variable called chipo.

In [ ]:
chipo=df.copy()

4. See the first 10 entries

In [ ]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

5. What is the number of observations in the dataset?

In [ ]:
#Muestra el numero total de elementos (multipliccion de filas por columnas)
print(chipo.size)

23110

6. What is the number of columns in the dataset?

In [ ]:
#Muestra el numero de filas
print(chipo.shape[0])

#Muestra el numero de columnas
print(chipo.shape[1])

4622
5

7. Print the name of all the columns.

In [ ]:
#Mostrar el nombre de las columnas 
print(chipo.columns)

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

9. Which was the most-ordered item?

In [ ]:
#Utilizamos value_counts() para obtener el recuento de cada producto
counts= chipo['item_name'].value_counts()
counts

Chicken Bowl                             726
Chicken Burrito                          553
Chips and Guacamole                      479
Steak Burrito                            368
Canned Soft Drink                        301
Steak Bowl                               211
Chips                                    211
Bottled Water                            162
Chicken Soft Tacos                       115
Chips and Fresh Tomato Salsa             110
Chicken Salad Bowl                       110
Canned Soda                              104
Side of Chips                            101
Veggie Burrito                            95
Barbacoa Burrito                          91
Veggie Bowl                               85
Carnitas Bowl                             68
Barbacoa Bowl                             66
Carnitas Burrito                          59
Steak Soft Tacos                          55
6 Pack Soft Drink                         54
Chips and Tomatillo Red Chili Salsa       48
Chicken Crispy Tacos                      47
Chips and Tomatillo Green Chili Salsa     43
Carnitas Soft Tacos                       40
Steak Crispy Tacos                        35
Chips and Tomatillo-Green Chili Salsa     31
Steak Salad Bowl                          29
Nantucket Nectar                          27
Barbacoa Soft Tacos                       25
Chips and Roasted Chili Corn Salsa        22
Izze                                      20
Chips and Tomatillo-Red Chili Salsa       20
Veggie Salad Bowl                         18
Chips and Roasted Chili-Corn Salsa        18
Barbacoa Crispy Tacos                     11
Barbacoa Salad Bowl                       10
Chicken Salad                              9
Veggie Soft Tacos                          7
Carnitas Crispy Tacos                      7
Veggie Salad                               6
Carnitas Salad Bowl                        6
Burrito                                    6
Steak Salad                                4
Crispy Tacos                               2
Salad                                      2
Bowl                                       2
Chips and Mild Fresh Tomato Salsa          1
Veggie Crispy Tacos                        1
Carnitas Salad                             1
Name: item_name, dtype: int64

In [ ]:
#Obtenemos el producto mas pedido 
producto_mas_pedido= counts.index[0]
print("El producto_mas_pedido es: ", producto_mas_pedido)

El producto_mas_pedido es:  Chicken Bowl

10. For the most-ordered item, how many items were ordered?

In [ ]:
#Utilizamos value_counts() para obtener el recuento de cada producto
counts= chipo['item_name'].value_counts()

#Obtenemos el producto mas pedido
producto_mas_pedido= counts.index[0]

#Seleccionamos las filas que corresponden al producto más pedido
Filas_producto_mas_pedido= chipo.loc[chipo['item_name']== producto_mas_pedido]

#Obtenemos las cantidades del producto más pedido
cantidades_producto_mas_pedido = Filas_producto_mas_pedido['quantity']

#mostramos las cantidaes del producto mas pedido
print("Las cantidades del producto más pedido son: ")
print(cantidades_producto_mas_pedido)

Las cantidades del producto más pedido son:
4       2
5       1
13      1
19      1
26      1
       ..
4590    1
4591    1
4595    1
4599    1
4604    1
Name: quantity, Length: 726, dtype: int64

In [ ]:
# Utilizamos groupby() para agrupar las filas por producto y sumar las cantidades
suma_por_producto=chipo.groupby('item_name')['quantity'].sum()

#Obtenemos la suma total del producto chicken bowl
suma_producto_chicken_bowl=suma_por_producto['Chicken Bowl']

#mostramos la suma total del producto 
print("La suma total del producto es: ", suma_producto_chicken_bowl)

La suma total del producto es:  761

11. What was the most ordered item in the choice_description column?

In [ ]:
counts_choicedescription= chipo['choice_description'].value_counts()
counts_choicedescription

[Diet Coke]                                                                                                                                      134
[Coke]                                                                                                                                           123
[Sprite]                                                                                                                                          77
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Lettuce]]                                                                            42
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Guacamole, Lettuce]]                                                                 40
                                                                                                                                                ...
[Fresh Tomato Salsa (Mild), [Pinto Beans, Black Beans, Rice, Cheese, Sour Cream, Lettuce]]                                                         1
[[Fresh Tomato Salsa (Mild), Roasted Chili Corn Salsa (Medium), Tomatillo-Red Chili Salsa (Hot)], [Pinto Beans, Cheese, Sour Cream, Lettuce]]      1
[Fresh Tomato (Mild), [Guacamole, Rice, Black Beans]]                                                                                              1
[[Tomatillo-Green Chili Salsa (Medium), Tomatillo-Red Chili Salsa (Hot)], [Black Beans, Rice, Cheese, Lettuce]]                                    1
[Tomatillo Green Chili Salsa, [Rice, Fajita Vegetables, Black Beans, Guacamole]]                                                                   1
Name: choice_description, Length: 1043, dtype: int64

In [ ]:
#Obtenemos el producto mas pedido en la columna choice_description
producto_mas_pedido_columna_choice= counts_choicedescription.index[0]
print("El producto_mas_pedido es: ", producto_mas_pedido_columna_choice)

El producto_mas_pedido es:  [Diet Coke]

12. How many items were orderd in total?

In [ ]:
# Utilizamos groupby() para agrupar las filas por producto y sumar las cantidades
suma_por_producto_choice=chipo.groupby('choice_description')['quantity'].sum()


#Obtenemos la suma total del producto Diet Coke
suma_producto_Diet_Coke=suma_por_producto_choice['[Diet Coke]']


#mostramos la suma total del producto 
print("La suma total del producto es: ", suma_producto_Diet_Coke)

La suma total del producto es:  159

13. Turn the item price into a float

13.a. Check the item price type

In [ ]:
print(chipo.dtypes)

13.b. Change the type of the column into a float

In [ ]:
# Eliminamos el simbolo del dolar 
chipo['item_price']=chipo['item_price'].str.replace('$', '')

#Convertimos la coluna 2 de tipo object a tipo float
chipo['item_price']= chipo['item_price'].astype(float)

#Mostramos el dataframe resultante
print(chipo.dtypes)

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

<ipython-input-10-ef2fba1b60a9>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  chipo['item_price']=chipo['item_price'].str.replace('$', '')

13.c. Check the item price type

In [ ]:
print(chipo.dtypes)

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

14. How much was the revenue for the period in the dataset?

In [ ]:
#Calculamos la suma de la multiplicacion de las columnas precio y numero de orden

ingreso=(chipo['quantity']* chipo['item_price']).sum()

#Mostramos resultado
ingreso

39237.02

15. How many orders were made in the period?

In [ ]:
numero_ordenes= chipo['quantity'].sum() 

numero_ordenes

4972

16. What is the average revenue amount per order?

In [ ]:
#Creamos la Variable ingreso
chipo['ingresos']= chipo['quantity']*chipo['item_price']

#calculamos el ingreso promedio por pedido
ingreso_promedio= chipo.groupby('quantity')['ingresos'].mean()

print(ingreso_promedio)

quantity
1       7.175901
2      23.686786
3      40.120714
4      52.384000
5      37.500000
7      73.500000
8     108.160000
10    150.000000
15    663.750000
Name: ingresos, dtype: float64

17. How many different items are sold?

In [ ]:
num_productos=chipo['item_name'].nunique()

print(num_productos)

50

18. How many products cost more than $10.00?

In [ ]:
#cuales son los productos que costaron mas de 10
productos_mayor_10=chipo[chipo['item_price']>10]

# Si queremos contar cuantos productos diferentes costaron más de 10
num_productos_mayor_10=productos_mayor_10['item_name'].nunique()

print(num_productos_mayor_10)

31

## Filtrar datos
Referencias:
* [Reset Index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html)
* [Sort values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values)

19. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [ ]:
print(chipo[['item_name', 'item_price']])

                                  item_name  item_price
0              Chips and Fresh Tomato Salsa        2.39
1                                      Izze        3.39
2                          Nantucket Nectar        3.39
3     Chips and Tomatillo-Green Chili Salsa        2.39
4                              Chicken Bowl       16.98
...                                     ...         ...
4617                          Steak Burrito       11.75
4618                          Steak Burrito       11.75
4619                     Chicken Salad Bowl       11.25
4620                     Chicken Salad Bowl        8.75
4621                     Chicken Salad Bowl        8.75

[4622 rows x 2 columns]

20. Sort by the name of the item

In [ ]:
productos_ordenados=chipo.sort_values(by='item_name')
print(productos_ordenados)

      order_id  quantity          item_name  \
3389      1360         2  6 Pack Soft Drink
341        148         1  6 Pack Soft Drink
1849       749         1  6 Pack Soft Drink
1860       754         1  6 Pack Soft Drink
2713      1076         1  6 Pack Soft Drink
...        ...       ...                ...
2384       948         1  Veggie Soft Tacos
781        322         1  Veggie Soft Tacos
2851      1132         1  Veggie Soft Tacos
1699       688         1  Veggie Soft Tacos
1395       567         1  Veggie Soft Tacos

                                     choice_description  item_price
3389                                        [Diet Coke]       12.98
341                                         [Diet Coke]        6.49
1849                                             [Coke]        6.49
1860                                        [Diet Coke]        6.49
2713                                             [Coke]        6.49
...                                                 ...         ...
2384  [Roasted Chili Corn Salsa, [Fajita Vegetables,...        8.75
781   [Fresh Tomato Salsa, [Black Beans, Cheese, Sou...        8.75
2851  [Roasted Chili Corn Salsa (Medium), [Black Bea...        8.49
1699  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...       11.25
1395  [Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...        8.49

[4622 rows x 5 columns]

21. What was the quantity of the most expensive item ordered?

In [ ]:
#Primero encontramos el producto con el precio unitario mas alto
precio_maximo=chipo.nlargest(1,'item_price')

#luego fobtenemos la cantidad de ese producto 
nombre_producto_precio_maximo=precio_maximo['item_name'].values[0]
cantidad_producto_precio_maximo= precio_maximo['quantity'].values[0]

print(f"El producto mas caro pedido fue {nombre_producto_precio_maximo} con una cantidad de {cantidad_producto_precio_maximo}")

El producto mas caro pedido fue Chips and Fresh Tomato Salsa con una cantidad de 15

22. How many times was a Veggie Salad Bowl ordered?

In [ ]:
#Podemos usar un filtro en la columna item_name para obteenr las filas correspondientes al VEggie Salad Bowl
pedidos_Veggie_salad=chipo[chipo['item_name']=='Veggie Salad Bowl']

#Luego podemos usar sum() en la columna quantity para obtener la suma total pedida
cantidad_Veggie_salad_pedido=pedidos_Veggie_salad['quantity'].sum()

cantidad_Veggie_salad_pedido

18

23. How many times did someone order more than one Canned Soda?

In [ ]:
#Obtenemos un filto para obtener las filas correspondientes a Canned Soda
pedidos_Canned_soda= chipo[chipo['item_name']=='Canned Soda']

#Luego usamos condiciones logicas para filtrar las filas que cumplan con las condiciones de interes(aquellas con quantity >1)
pedidos_Canned_soda_mas_de_una_vez= pedidos_Canned_soda[pedidos_Canned_soda['quantity']>1]

#Contamos el numero de filas que cumplen con esta condicion con shape[0]

cantidad_Canned_soda_mas_de_una_vez=pedidos_Canned_soda_mas_de_una_vez.shape[0]

cantidad_Canned_soda_mas_de_una_vez

20

## GroupBy

Referencias:
* [Describe](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html)

GroupBy can be summarized as Split-Apply-Combine. Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)

24. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/drinks.csv).

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame()
df= pd.read_csv('https://facuzeta.github.io/udesa/01_programacion/guias/datasets/drinks.csv')
df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

25. Assign it to a variable called drinks.

In [ ]:
drinks= df.copy()

26. Which continent drinks more beer on average?

In [ ]:
#Agrupar por continente y calcular el promedio de consumo de cerveza
cerveza_por_continente=df.groupby('continent')['beer_servings'].mean()

#Encontrar el continente con el mayor promedio de consumo de cerveza
continente_mayor_cerveza= cerveza_por_continente.idxmax()

print("Promedio por continente",cerveza_por_continente, "El continente que bebe más cerveza en promedio es:", continente_mayor_cerveza)

Promedio por continente continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64 El continente que bebe más cerveza en promedio es: EU

27. Print the mean alcohol consumption per continent for every column

In [ ]:
#Agrupar por continente y calcular la media para cada columna
media_por_continente=df.groupby('continent').mean()

#imprimir el resultado

print(media_por_continente)

           beer_servings  spirit_servings  wine_servings  \
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

           total_litres_of_pure_alcohol
continent
AF                             3.007547
AS                             2.170455
EU                             8.617778
OC                             3.381250
SA                             6.308333

28. Print the median alcohol consumption per continent for every column

In [ ]:
#Agrupar por continente y calcular la mediana para cada columna

mediana_por_continente=df.groupby('continent').median()

#Imprimir el resultado
print(mediana_por_continente)

           beer_servings  spirit_servings  wine_servings  \
continent
AF                  32.0              3.0            2.0
AS                  17.5             16.0            1.0
EU                 219.0            122.0          128.0
OC                  52.5             37.0            8.5
SA                 162.5            108.5           12.0

           total_litres_of_pure_alcohol
continent
AF                                 2.30
AS                                 1.20
EU                                10.00
OC                                 1.75
SA                                 6.85

29. Print the mean, min and max values for spirit consumption.

In [ ]:
#Obetener un resumen estadístico para el consumo de spirit_servings

resumen_spirit= df['spirit_servings'].describe()[['mean', 'min', 'max']]

#imprimir el resultado
print(resumen_spirit)

mean     80.994819
min       0.000000
max     438.000000
Name: spirit_servings, dtype: float64

## Apply: Student Alcohol Consumption
Referencias:
* [apply](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.groupby.GroupBy.apply.html?highlight=apply#pandas.core.groupby.GroupBy.apply)

30. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/student-mat.csv).

In [ ]:
import pandas as pd

Student=pd.read_csv('https://facuzeta.github.io/udesa/01_programacion/guias/datasets/student-mat.csv')
Student

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,...,5,5,4,4,5,4,11,9,9,9
391,MS,M,17,U,LE3,T,3,1,services,services,...,2,4,5,3,4,2,3,14,16,16
392,MS,M,21,R,GT3,T,1,1,other,other,...,5,5,3,3,3,3,3,10,8,7
393,MS,M,18,R,LE3,T,3,2,services,other,...,4,4,1,3,4,5,0,11,12,10
394,MS,M,19,U,LE3,T,1,1,other,at_home,...,3,2,3,3,3,5,5,8,9,9

31. Assign it to a variable called df.

In [ ]:
df= Student.copy()

32. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [ ]:
df.loc[:, 'school':'guardian']

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father
...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

In [ ]:
#si queremos obtener un nuevo dataFrame que contenga solo columnas desde "school" hasta "guardian"
new_df=df.loc[:, 'school': 'guardian']
print(new_df)

    school sex  age address famsize Pstatus  Medu  Fedu      Mjob      Fjob  \
0       GP   F   18       U     GT3       A     4     4   at_home   teacher
1       GP   F   17       U     GT3       T     1     1   at_home     other
2       GP   F   15       U     LE3       T     1     1   at_home     other
3       GP   F   15       U     GT3       T     4     2    health  services
4       GP   F   16       U     GT3       T     3     3     other     other
..     ...  ..  ...     ...     ...     ...   ...   ...       ...       ...
390     MS   M   20       U     LE3       A     2     2  services  services
391     MS   M   17       U     LE3       T     3     1  services  services
392     MS   M   21       R     GT3       T     1     1     other     other
393     MS   M   18       R     LE3       T     3     2  services     other
394     MS   M   19       U     LE3       T     1     1     other   at_home

     reason guardian
0    course   mother
1    course   father
2     other   mother
3      home   mother
4      home   father
..      ...      ...
390  course    other
391  course   mother
392  course    other
393  course   mother
394  course   father

[395 rows x 12 columns]

El código anterior selecciona todas las filas (:) del DataFrame y todas las columnas desde la columna "school" hasta la columna "guardian", ambos inclusive.

33. Create a function that will capitalize strings.

In [ ]:
def capitalizar_strings(lista_strings):
  """
  Esta función recibe una lista de string y capitaliza cada uno de ellos utilzando el método capitalize() de los strings
  """
  lista_capitalizada=[]
  for string in lista_string:
    lista_capitalizada.append(string.capitalize())
  return lista_capitalizada

34. Capitalize both Mjob and Fjob

In [ ]:
#Capitalizamos las columnas "Mjob" y "Fjob"
new_df.loc[:,['Mjob', 'Fjob']]= new_df.loc[:,['Mjob', 'Fjob']].applymap(str.capitalize)

#Imprimimos las primeras 5 filas del dataframe 
print(new_df.head())

  school sex  age address famsize Pstatus  Medu  Fedu     Mjob      Fjob  \
0     GP   F   18       U     GT3       A     4     4  At_home   Teacher
1     GP   F   17       U     GT3       T     1     1  At_home     Other
2     GP   F   15       U     LE3       T     1     1  At_home     Other
3     GP   F   15       U     GT3       T     4     2   Health  Services
4     GP   F   16       U     GT3       T     3     3    Other     Other

   reason guardian
0  course   mother
1  course   father
2   other   mother
3    home   mother
4    home   father

35. Print the last elements of the data set.

In [ ]:
new_df.tail(5)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
390,MS,M,20,U,LE3,A,2,2,Services,Services,course,other
391,MS,M,17,U,LE3,T,3,1,Services,Services,course,mother
392,MS,M,21,R,GT3,T,1,1,Other,Other,course,other
393,MS,M,18,R,LE3,T,3,2,Services,Other,course,mother
394,MS,M,19,U,LE3,T,1,1,Other,At_home,course,father

36. Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [ ]:
#Creamos la función mayoria  que devuelve un valor booleano en base a la edad de una peronsa
def mayoria(age):
  if age>17:
    return True
  else:
    return False
#PAra aplicar esta función a la columna age y crear una nueva columna usamos apply() de pandas

new_df['legal_dinker']= Student['age'].apply(mayoria)

new_df

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,legal_dinker
0,GP,F,18,U,GT3,A,4,4,At_home,Teacher,course,mother,True
1,GP,F,17,U,GT3,T,1,1,At_home,Other,course,father,False
2,GP,F,15,U,LE3,T,1,1,At_home,Other,other,mother,False
3,GP,F,15,U,GT3,T,4,2,Health,Services,home,mother,False
4,GP,F,16,U,GT3,T,3,3,Other,Other,home,father,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,Services,Services,course,other,True
391,MS,M,17,U,LE3,T,3,1,Services,Services,course,mother,False
392,MS,M,21,R,GT3,T,1,1,Other,Other,course,other,True
393,MS,M,18,R,LE3,T,3,2,Services,Other,course,mother,True
394,MS,M,19,U,LE3,T,1,1,Other,At_home,course,father,True

## Merge: Housing Market
Referencias:
* [randint](https://docs.scipy.org/doc/numpy-1.15.1/reference/generated/numpy.random.randint.html)

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

37. Import the necessary libraries

In [ ]:
import numpy as np

38. Create 3 differents Series, each of length 100, as follows: 
<br>
    The first a random number from 1 to 4 
    <br>
    The second a random number from 1 to 3
    <br>
    The third a random number from 10,000 to 30,000

In [ ]:
# Crear la primera serie aleatoria del 1 a 4
serie1= np.random.randint(low=1, high=5, size=100)

#crear la segunda serie aleatoria del 1 al 3
serie2=np.random.randint(low=1, high=4, size=100)

#Crear la tercera serie aleatoria de 10,000 a 30,000
serie3= np.random.randint(low=10000, high=30001, size=100)

39. Let's create a DataFrame by joinning the Series by column

In [ ]:
import pandas as pd

#Creamos un diccionario con las tres series
datos={'Serie 1': serie1, 'Serie 2':serie2, 'Serie 3': serie3}

#Creamos el dataframe a partir del diccionario
df=pd.DataFrame(datos)

df

    Serie 1  Serie 2  Serie 3
0         1        1    14568
1         4        1    12633
2         4        1    10705
3         2        1    15003
4         1        2    17207
..      ...      ...      ...
95        1        3    12285
96        2        3    19102
97        4        1    28166
98        2        3    27624
99        3        2    27094

[100 rows x 3 columns]

40. Change the name of the columns to bedrs, bathrs, price_sqr_meter

Tenemos dos formas de Hacerlo: Una general y otra una por una.

In [ ]:
#creamos una lista con los nuevos nombres de las columnas
nuevas_columnas=['bedrs', 'bathrs', 'price_sqr_meter']

#Asignar los nuevos nombres de las columnas al dataframe
df.columns=nuevas_columnas
df

    bedrs  bathrs  price_sqr_meter
0       1       1            14568
1       4       1            12633
2       4       1            10705
3       2       1            15003
4       1       2            17207
..    ...     ...              ...
95      1       3            12285
96      2       3            19102
97      4       1            28166
98      2       3            27624
99      3       2            27094

[100 rows x 3 columns]

In [ ]:
#cambiar el nombre de la primera columna a "bedrs"
df=df.rename(columns={'Serie 1': 'bedrs'})

#Cambiar a la segunda
df=df.rename(columns={'Serie 2': 'bathrs'})

#Cambiar el nombre de la tercera columna a "price_sqr_meter"
df=df.rename(columns={'Serie 3': 'price_sqr_meter'})

#Nota este codigo no se corre de nuevo porque ya fueron cambiadas con el codigo anterior

41. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [ ]:
#Crear el dataframe con una columna "bigcolumn" con los valores de la serie 3
df_bigcolumn=pd.DataFrame({'bigcolumn': serie3})

#Verificamos el dataframe
print(df_bigcolumn.head())

   bigcolumn
0      14568
1      12633
2      10705
3      15003
4      17207

42. Oops, it seems it is going only until index 99. Is it true?

In [ ]:
print(len(serie3))

100

43. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
#Utilizamos el método reset_index() para volver a indexar el Dataframe
df_reindex=df.reset_index(drop=True)

#VErificamos el nuevo DataFrame
print(df_reindex.head())

   bedrs  bathrs  price_sqr_meter
0      1       1            14568
1      4       1            12633
2      4       1            10705
3      2       1            15003
4      1       2            17207

## Stats: US - Baby Names

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014

44. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/US_Baby_Names_right.csv.zip).

In [ ]:
!pip install wget

import wget
import zipfile
import pandas as pd

# descargar el archivo comprimido
url = 'https://facuzeta.github.io/udesa/01_programacion/guias/datasets/US_Baby_Names_right.csv.zip'
wget.download(url, 'US_Baby_Names_right.csv.zip')

# descomprimir el archivo
with zipfile.ZipFile('US_Baby_Names_right.csv.zip', 'r') as zip_ref:
    zip_ref.extractall()

# cargar el conjunto de datos en un DataFrame
df = pd.read_csv('US_Baby_Names_right.csv')

# verificar los primeros registros del DataFrame
print(df.head())

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: wget in /usr/local/lib/python3.9/dist-packages (3.2)
   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

45. Assign it to a variable called baby_names.

In [ ]:
baby_names=df.copy()

46. See the first 10 entries

In [ ]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

47. Delete the column 'Unnamed: 0' and 'Id'

In [ ]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)

48. Is there more male or female names in the dataset?

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

49. Group the dataset by name and assign to names

In [ ]:
gender_counts=baby_names.groupby('Gender')['Name'].count()

print(gender_counts)

Gender
F    558846
M    457549
Name: Name, dtype: int64

In [ ]:
# Para calcular la proporcion de nombres de hombres y mujeres en el cojunto de datos:

total_names=len(baby_names)
prop_male=gender_counts['M']/total_names
prop_female=gender_counts['F']/total_names

print('Proporción de nombres masculinos:', prop_male)
print('Proporcion de nombres femeninos:', prop_female)

Proporción de nombres masculinos: 0.45016848764505923
Proporcion de nombres femeninos: 0.5498315123549408

50. How many different names exist in the dataset?

In [ ]:
num_names=df['Name'].unique()
print('Numero de diferentes nombres:', num_names)

Numero de diferentes nombres: ['Emma' 'Madison' 'Hannah' ... 'Braun' 'Evrett' 'Coalton']

In [ ]:
# Podemos contar el numero de nombres unicos en el conjunto de dato
num_unique_names=baby_names['Name'].nunique()

print("El número de nombres diferentes en el conjunto de datos es:", num_unique_names)

El número de nombres diferentes en el conjunto de datos es: 17632

51. What is the name with most occurrences?

In [ ]:
most_comon_name=baby_names['Name'].value_counts().idxmax()
print('El nombre mas común es:', most_comon_name)

El nombre mas común es: Riley

52. How many different names have the least occurrences?

In [ ]:
#Agrupamos los datos por nombre y sumamos sus frecuencias para tener el umero total de ocurrencia de cada nombre
name_counts=baby_names.groupby('Name')['Count'].sum()
name_counts

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

In [ ]:
#A continuación podemos contar el numero de nombres diferentes que tiene el mismo numero minimo de ocurrencias
min_count=name_counts.min()

min_count

5

In [ ]:
#Luego podemos seleccionar solo los nombres que tiene el numero mínimo de ocurrencias 
#y contar cuantos nombres diferentes hay

min_count_names= name_counts[name_counts== min_count]
num_names=len(min_count_names)
num_names

2578

53. What is the median name occurrence?

In [ ]:
#Encontramos el numero total de ocurrencia de cada nombre
name_counts=baby_names.groupby('Name')['Count'].sum()
name_counts

Name
Aaban        12
Aadan        23
Aadarsh       5
Aaden      3426
Aadhav        6
           ...
Zyra         42
Zyrah        11
Zyren         6
Zyria        59
Zyriah       58
Name: Count, Length: 17632, dtype: int64

In [ ]:
#Luego calculamos la mediana de las frecuencias de los nombres 
median_count=name_counts.median()

print("La mediana de ocurrencia de nombre es:", median_count)

La mediana de ocurrencia de nombre es: 49.0

54. What is the standard deviation of names?

In [ ]:
name_count=baby_names.groupby('Name')['Count'].sum()

std_count=name_counts.std()

print("La desviación estándar de los nombrs es:", std_count)

La desviación estándar de los nombrs es: 11006.06946789057

55. Get a summary with the mean, min, max, std and quartiles.

In [ ]:
count_summary=baby_names['Count'].describe()

print(count_summary)

count    1.016395e+06
mean     3.485012e+01
std      9.739735e+01
min      5.000000e+00
25%      7.000000e+00
50%      1.100000e+01
75%      2.600000e+01
max      4.167000e+03
Name: Count, dtype: float64

## Deleting: Iris
Referencias:
* [fillna](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html)

56. Import the dataset from this [address](https://facuzeta.github.io/udesa/01_programacion/guias/datasets/iris.data).

In [110]:
import pandas as pd
import urllib.request

url = "https://facuzeta.github.io/udesa/01_programacion/guias/datasets/iris.data"

# Descargar el archivo desde la URL
filename, headers = urllib.request.urlretrieve(url)

# Cargar el archivo en un DataFrame de pandas
iris_df = pd.read_csv(filename, header=None, names=['SepalLength', 'SepalWidth', 'PetalLength', 'PetalWidth', 'Class'])

# Mostrar las primeras filas del DataFrame
print(iris_df.head())

   SepalLength  SepalWidth  PetalLength  PetalWidth        Class
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [101]:
import pandas as pd
import requests

url = "https://facuzeta.github.io/udesa/01_programacion/guias/datasets/iris.data"

# Descargar el archivo desde la URL
response = requests.get(url)
open('iris.csv', 'wb').write(response.content)

# Cargar el archivo en un DataFrame de pandas
iris_df = pd.read_csv('iris.csv', header=None, names=['SepalLength', 'SepalWidth', 'PetalLength', 'PetalWidth', 'Class'])

# Mostrar las primeras filas del DataFrame
print(iris_df.head())

   SepalLength  SepalWidth  PetalLength  PetalWidth        Class
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

57. Assign it to a variable called iris

In [111]:
iris=iris_df.copy()
iris

     SepalLength  SepalWidth  PetalLength  PetalWidth           Class
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

58. Create columns for the dataset

In [ ]:
# 1. sepal_length (in cm)
# 2. sepal_width (in cm)
# 3. petal_length (in cm)
# 4. petal_width (in cm)
# 5. class

In [112]:
# Factor de conversión de cm a pulgadas
cm_to_inches = 0.393701

# Crear columnas en centímetros
iris['sepal_length_cm'] = iris['SepalLength'] * cm_to_inches
iris['sepal_width_cm'] = iris['SepalWidth'] * cm_to_inches
iris['petal_length_cm'] = iris['PetalLength'] * cm_to_inches
iris['petal_width_cm'] = iris['PetalWidth'] * cm_to_inches

iris.head()

,SepalLength,SepalWidth,PetalLength,PetalWidth,Class,sepal_length_cm,sepal_width_cm,petal_length_cm,petal_width_cm
0,5.1,3.5,1.4,0.2,Iris-setosa,2.007875,1.377954,0.551181,0.07874
1,4.9,3.0,1.4,0.2,Iris-setosa,1.929135,1.181103,0.551181,0.07874
2,4.7,3.2,1.3,0.2,Iris-setosa,1.850395,1.259843,0.511811,0.07874
3,4.6,3.1,1.5,0.2,Iris-setosa,1.811025,1.220473,0.590552,0.07874
4,5.0,3.6,1.4,0.2,Iris-setosa,1.968505,1.417324,0.551181,0.07874

59.  Is there any missing value in the dataframe?

In [120]:
print(iris.isnull().sum())

SepalLength        0
SepalWidth         0
PetalLength        0
PetalWidth         0
Class              0
sepal_length_cm    0
sepal_width_cm     0
petal_length_cm    0
petal_width_cm     0
dtype: int64

60.  Lets set the values of the rows 10 to 29 of the column 'petal_length' to NaN

In [125]:
import numpy as np

#Establecer los valores de las filas 10 y 29 de la columna "petal" en NaN 
#(Solo cambia los valores de la fila 10 y 29)
iris.loc[(iris.index==10)| (iris.index==29), 'petal_length_cm']=np.nan

#mostramos las primeras filas del DataFrame
print(iris.head(30))

    SepalLength  SepalWidth  PetalLength  PetalWidth        Class  \
0           5.1         3.5          1.4         0.2  Iris-setosa
1           4.9         3.0          1.4         0.2  Iris-setosa
2           4.7         3.2          1.3         0.2  Iris-setosa
3           4.6         3.1          1.5         0.2  Iris-setosa
4           5.0         3.6          1.4         0.2  Iris-setosa
5           5.4         3.9          1.7         0.4  Iris-setosa
6           4.6         3.4          1.4         0.3  Iris-setosa
7           5.0         3.4          1.5         0.2  Iris-setosa
8           4.4         2.9          1.4         0.2  Iris-setosa
9           4.9         3.1          1.5         0.1  Iris-setosa
10          5.4         3.7          1.5         0.2  Iris-setosa
11          4.8         3.4          1.6         0.2  Iris-setosa
12          4.8         3.0          1.4         0.1  Iris-setosa
13          4.3         3.0          1.1         0.1  Iris-setosa
14          5.8         4.0          1.2         0.2  Iris-setosa
15          5.7         4.4          1.5         0.4  Iris-setosa
16          5.4         3.9          1.3         0.4  Iris-setosa
17          5.1         3.5          1.4         0.3  Iris-setosa
18          5.7         3.8          1.7         0.3  Iris-setosa
19          5.1         3.8          1.5         0.3  Iris-setosa
20          5.4         3.4          1.7         0.2  Iris-setosa
21          5.1         3.7          1.5         0.4  Iris-setosa
22          4.6         3.6          1.0         0.2  Iris-setosa
23          5.1         3.3          1.7         0.5  Iris-setosa
24          4.8         3.4          1.9         0.2  Iris-setosa
25          5.0         3.0          1.6         0.2  Iris-setosa
26          5.0         3.4          1.6         0.4  Iris-setosa
27          5.2         3.5          1.5         0.2  Iris-setosa
28          5.2         3.4          1.4         0.2  Iris-setosa
29          4.7         3.2          1.6         0.2  Iris-setosa

    sepal_length_cm  sepal_width_cm  petal_length_cm  petal_width_cm
0          2.007875        1.377954         0.551181        0.078740
1          1.929135        1.181103         0.551181        0.078740
2          1.850395        1.259843         0.511811        0.078740
3          1.811025        1.220473         0.590552        0.078740
4          1.968505        1.417324         0.551181        0.078740
5          2.125985        1.535434         0.669292        0.157480
6          1.811025        1.338583         0.551181        0.118110
7          1.968505        1.338583         0.590552        0.078740
8          1.732284        1.141733         0.551181        0.078740
9          1.929135        1.220473         0.590552        0.039370
10         2.125985        1.456694              NaN        0.078740
11         1.889765        1.338583         0.629922        0.078740
12         1.889765        1.181103         0.551181        0.039370
13         1.692914        1.181103         0.433071        0.039370
14         2.283466        1.574804         0.472441        0.078740
15         2.244096        1.732284         0.590552        0.157480
16         2.125985        1.535434         0.511811        0.157480
17         2.007875        1.377954         0.551181        0.118110
18         2.244096        1.496064         0.669292        0.118110
19         2.007875        1.496064         0.590552        0.118110
20         2.125985        1.338583         0.669292        0.078740
21         2.007875        1.456694         0.590552        0.157480
22         1.811025        1.417324         0.393701        0.078740
23         2.007875        1.299213         0.669292        0.196851
24         1.889765        1.338583         0.748032        0.078740
25         1.968505        1.181103         0.629922        0.078740
26         1.968505        1.338583         0.629922        0.157480
27         2.047245        1.377954         0.590552        0.078740
28         2.047245        1.338583         0.551181        0.078740
29         1.850395        1.259843              NaN        0.078740

In [131]:
# SI queremos establecer todos los valores desde la 10 hasta la 29 Hacemos:
iris.loc[10:29, 'petal_length_cm']= np.nan

#para mostar las filas desde 10 hasta 29 usamos .iloc[]
print(iris.iloc[10:30])

    SepalLength  SepalWidth  PetalLength  PetalWidth        Class  \
10          5.4         3.7          1.5         0.2  Iris-setosa
11          4.8         3.4          1.6         0.2  Iris-setosa
12          4.8         3.0          1.4         0.1  Iris-setosa
13          4.3         3.0          1.1         0.1  Iris-setosa
14          5.8         4.0          1.2         0.2  Iris-setosa
15          5.7         4.4          1.5         0.4  Iris-setosa
16          5.4         3.9          1.3         0.4  Iris-setosa
17          5.1         3.5          1.4         0.3  Iris-setosa
18          5.7         3.8          1.7         0.3  Iris-setosa
19          5.1         3.8          1.5         0.3  Iris-setosa
20          5.4         3.4          1.7         0.2  Iris-setosa
21          5.1         3.7          1.5         0.4  Iris-setosa
22          4.6         3.6          1.0         0.2  Iris-setosa
23          5.1         3.3          1.7         0.5  Iris-setosa
24          4.8         3.4          1.9         0.2  Iris-setosa
25          5.0         3.0          1.6         0.2  Iris-setosa
26          5.0         3.4          1.6         0.4  Iris-setosa
27          5.2         3.5          1.5         0.2  Iris-setosa
28          5.2         3.4          1.4         0.2  Iris-setosa
29          4.7         3.2          1.6         0.2  Iris-setosa

    sepal_length_cm  sepal_width_cm  petal_length_cm  petal_width_cm
10         2.125985        1.456694              NaN        0.078740
11         1.889765        1.338583              NaN        0.078740
12         1.889765        1.181103              NaN        0.039370
13         1.692914        1.181103              NaN        0.039370
14         2.283466        1.574804              NaN        0.078740
15         2.244096        1.732284              NaN        0.157480
16         2.125985        1.535434              NaN        0.157480
17         2.007875        1.377954              NaN        0.118110
18         2.244096        1.496064              NaN        0.118110
19         2.007875        1.496064              NaN        0.118110
20         2.125985        1.338583              NaN        0.078740
21         2.007875        1.456694              NaN        0.157480
22         1.811025        1.417324              NaN        0.078740
23         2.007875        1.299213              NaN        0.196851
24         1.889765        1.338583              NaN        0.078740
25         1.968505        1.181103              NaN        0.078740
26         1.968505        1.338583              NaN        0.157480
27         2.047245        1.377954              NaN        0.078740
28         2.047245        1.338583              NaN        0.078740
29         1.850395        1.259843              NaN        0.078740

61. Good, now lets substitute the NaN values to 1.0

In [134]:
#sustituimos los valores Nan con 1.0
iris['petal_length_cm']= iris['petal_length_cm'].fillna(1.0)

# mostramos los cambios
print(iris.iloc[10:30])

    SepalLength  SepalWidth  PetalLength  PetalWidth        Class  \
10          5.4         3.7          1.5         0.2  Iris-setosa
11          4.8         3.4          1.6         0.2  Iris-setosa
12          4.8         3.0          1.4         0.1  Iris-setosa
13          4.3         3.0          1.1         0.1  Iris-setosa
14          5.8         4.0          1.2         0.2  Iris-setosa
15          5.7         4.4          1.5         0.4  Iris-setosa
16          5.4         3.9          1.3         0.4  Iris-setosa
17          5.1         3.5          1.4         0.3  Iris-setosa
18          5.7         3.8          1.7         0.3  Iris-setosa
19          5.1         3.8          1.5         0.3  Iris-setosa
20          5.4         3.4          1.7         0.2  Iris-setosa
21          5.1         3.7          1.5         0.4  Iris-setosa
22          4.6         3.6          1.0         0.2  Iris-setosa
23          5.1         3.3          1.7         0.5  Iris-setosa
24          4.8         3.4          1.9         0.2  Iris-setosa
25          5.0         3.0          1.6         0.2  Iris-setosa
26          5.0         3.4          1.6         0.4  Iris-setosa
27          5.2         3.5          1.5         0.2  Iris-setosa
28          5.2         3.4          1.4         0.2  Iris-setosa
29          4.7         3.2          1.6         0.2  Iris-setosa

    sepal_length_cm  sepal_width_cm  petal_length_cm  petal_width_cm
10         2.125985        1.456694              1.0        0.078740
11         1.889765        1.338583              1.0        0.078740
12         1.889765        1.181103              1.0        0.039370
13         1.692914        1.181103              1.0        0.039370
14         2.283466        1.574804              1.0        0.078740
15         2.244096        1.732284              1.0        0.157480
16         2.125985        1.535434              1.0        0.157480
17         2.007875        1.377954              1.0        0.118110
18         2.244096        1.496064              1.0        0.118110
19         2.007875        1.496064              1.0        0.118110
20         2.125985        1.338583              1.0        0.078740
21         2.007875        1.456694              1.0        0.157480
22         1.811025        1.417324              1.0        0.078740
23         2.007875        1.299213              1.0        0.196851
24         1.889765        1.338583              1.0        0.078740
25         1.968505        1.181103              1.0        0.078740
26         1.968505        1.338583              1.0        0.157480
27         2.047245        1.377954              1.0        0.078740
28         2.047245        1.338583              1.0        0.078740
29         1.850395        1.259843              1.0        0.078740

62. Now let's delete the column class

In [136]:
iris=iris.drop('Class', axis=1)

print(iris.iloc[1:10])

   SepalLength  SepalWidth  PetalLength  PetalWidth  sepal_length_cm  \
1          4.9         3.0          1.4         0.2         1.929135
2          4.7         3.2          1.3         0.2         1.850395
3          4.6         3.1          1.5         0.2         1.811025
4          5.0         3.6          1.4         0.2         1.968505
5          5.4         3.9          1.7         0.4         2.125985
6          4.6         3.4          1.4         0.3         1.811025
7          5.0         3.4          1.5         0.2         1.968505
8          4.4         2.9          1.4         0.2         1.732284
9          4.9         3.1          1.5         0.1         1.929135

   sepal_width_cm  petal_length_cm  petal_width_cm
1        1.181103         0.551181         0.07874
2        1.259843         0.511811         0.07874
3        1.220473         0.590552         0.07874
4        1.417324         0.551181         0.07874
5        1.535434         0.669292         0.15748
6        1.338583         0.551181         0.11811
7        1.338583         0.590552         0.07874
8        1.141733         0.551181         0.07874
9        1.220473         0.590552         0.03937

63.  Set the first 3 rows as NaN

In [137]:
iris.loc[:2, :]= np.nan

print(iris.head())

   SepalLength  SepalWidth  PetalLength  PetalWidth  sepal_length_cm  \
0          NaN         NaN          NaN         NaN              NaN
1          NaN         NaN          NaN         NaN              NaN
2          NaN         NaN          NaN         NaN              NaN
3          4.6         3.1          1.5         0.2         1.811025
4          5.0         3.6          1.4         0.2         1.968505

   sepal_width_cm  petal_length_cm  petal_width_cm
0             NaN              NaN             NaN
1             NaN              NaN             NaN
2             NaN              NaN             NaN
3        1.220473         0.590552         0.07874
4        1.417324         0.551181         0.07874

64.  Delete the rows that have NaN

In [138]:
#Eliminar las filas con valores Nan con dropna

iris=iris.dropna()
print(iris.head())

   SepalLength  SepalWidth  PetalLength  PetalWidth  sepal_length_cm  \
3          4.6         3.1          1.5         0.2         1.811025
4          5.0         3.6          1.4         0.2         1.968505
5          5.4         3.9          1.7         0.4         2.125985
6          4.6         3.4          1.4         0.3         1.811025
7          5.0         3.4          1.5         0.2         1.968505

   sepal_width_cm  petal_length_cm  petal_width_cm
3        1.220473         0.590552         0.07874
4        1.417324         0.551181         0.07874
5        1.535434         0.669292         0.15748
6        1.338583         0.551181         0.11811
7        1.338583         0.590552         0.07874

65. Reset the index so it begins with 0 again

In [139]:
#reiniciar el indice
iris=iris.reset_index(drop=True)

#Mostrar los resultados
print(iris.head())

   SepalLength  SepalWidth  PetalLength  PetalWidth  sepal_length_cm  \
0          4.6         3.1          1.5         0.2         1.811025
1          5.0         3.6          1.4         0.2         1.968505
2          5.4         3.9          1.7         0.4         2.125985
3          4.6         3.4          1.4         0.3         1.811025
4          5.0         3.4          1.5         0.2         1.968505

   sepal_width_cm  petal_length_cm  petal_width_cm
0        1.220473         0.590552         0.07874
1        1.417324         0.551181         0.07874
2        1.535434         0.669292         0.15748
3        1.338583         0.551181         0.11811
4        1.338583         0.590552         0.07874

## Bonus:
Si quiere mas ejercicios visitar:
* https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles.ipynb
* https://www.machinelearningplus.com/python/101-pandas-exercises-python/